#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.aws_backup_plan.plan will be created
  + resource "aws_backup_plan" "plan" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "cq_backup_plan"
      + tags_all = (known after apply)
      + version  = (known after apply)

      + rule {
          + completion_window        = 180
          + enable_continuous_backup = false
          + rule_name                = "cq_backup_rule"
          + schedule                 = "cron(0 12 * * ? *)"
          + start_window             = 60
          + target_vault_name        = "cq_backup_vault"
        }
    }

  # module.demo.aws_backup_selection.selection will be created
  + resource "aws_backup_selection" "selection" {
      + iam_role_arn  = (known after apply)
      + id            = (known after apply)
      + name          = "cq_backup_selection"
      + not_resources = (known after apply)
      + plan_id       = (known after apply)

      + condition {
          + string_equals {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_like {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_not_equals {
              + key   = (known after apply)
              + value = (known after apply)
            }

          + string_not_like {
              + key   = (known after apply)
              + value = (known after apply)
            }
        }

      + selection_tag {
          + key   = "foo"
          + type  = "STRINGEQUALS"
          + value = "bar"
        }
    }

  # module.demo.aws_backup_vault.backup_vault will be created
  + resource "aws_backup_vault" "backup_vault" {
      + arn             = (known after apply)
      + id              = (known after apply)
      + kms_key_arn     = (known after apply)
      + name            = "cq_backup_vault"
      + recovery_points = (known after apply)
      + tags_all        = (known after apply)
    }

  # module.demo.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "allow"
                      + Principal = {
                          + Service = [
                              + "backup.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AWSBackupFullAccess",
        ]
      + max_session_duration  = 3600
      + name                  = "cq_backup_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.demo.aws_kms_key.backup_kms_key will be created
  + resource "aws_kms_key" "backup_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @irmatov, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*